# Найти корни квадратного уравнения Ax² + Bx + C = 0
# -Математикой
# -Используя дополнительные библиотеки*


def f(a,b,c):
    d = b**2 - 4*a*c
    x1= (-b+(d**0.5))/2*a
    x2= (-b-(d**0.5))/2*a
    return x1,x2

print(f(1,-5,6))


